Tekla Open API Reference for Tekla Structures 2025
RebarItem.HORIZONTAL_DISTANCE_STRING Field
 The horizontal distance string.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string HORIZONTAL_DISTANCE_STRING = "HorizontalDistance"
Public Const HORIZONTAL_DISTANCE_STRING As String = "HorizontalDistance"
Field Value
Type: String
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace